app/controllers/admin/courses_controller.rb

  def create
    if params[:course][:kind] == 'Test'
      params[:course].except(:level, :duration)
      create!(:notice => "Test course was successfully created.") {
        unit = resource.units.create(:title => resource.title)
---
INSERT INTO `units` (`title`, `course_id`, `created_at`, `updated_at`) VALUES ('diagnostic', 2, '2015-08-27 06:36:25.555610', '2015-08-27 06:36:25.555610')