app/controllers/admin/questions_controller.rb

  def new
    @unit = Unit.find(params[:unit_id])
---
SELECT  `units`.* FROM `units` WHERE `units`.`id` = 2 LIMIT 1