app/controllers/student/pages_controller.rb

SELECT `units`.* FROM `units` WHERE `units`.`course_id` = 2
SELECT COUNT(*) FROM `questions` WHERE `questions`.`unit_id` = 7
---
  def unit_events
   course = current_user.current_course
   counter_start = 0
   counter_end = 5
   first_chapter = 1
   @units = []
   @homework = []

   title_string = "Read " + "Unit "
   chapters_string = " (chapters "

   course.units.each do |unit|
      start_date = date_of_next("Monday", unit.course.duration.to_date)
      @units << { title: title_string + unit.title + chapters_string + first_chapter.to_s + "~ " + unit.questions.count.to_s + ")",
                  start: start_date + counter_start,
                  :end => start_date + counter_end }

SELECT `units`.* FROM `units` WHERE `units`.`course_id` = 2
---
  def homework_events
   course = current_user.current_course
   counter_start = 0
   counter_end = 2
   @homework = []

   course.units.each do |unit|